src/conf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОказываемыеПроцедуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/conf/InformationRegisters/ГрафикиРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаГрафика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/conf/Catalogs/Сотрудники/Ext/ManagerModule.bsl
// Функция читает данные графика работы из регистра.
Функция ПрочитатьДанныеГрафикаИзРегистра(Сотрудник, ПериодНач, ПериодКон) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ГрафикиРаботыСотрудников.ДатаГрафика КАК ДатаГрафика,
	|	ГрафикиРаботыСотрудников.Смена
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников
	|ГДЕ
	|	ГрафикиРаботыСотрудников.ДатаГрафика МЕЖДУ &ПериодНач И &ПериодКон
	|	И ГрафикиРаботыСотрудников.Сотрудник = &Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаГрафика";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Сотрудник",	Сотрудник);
	Запрос.УстановитьПараметр("ПериодНач",		ПериодНач);
	Запрос.УстановитьПараметр("ПериодКон",		ПериодКон);
	
	ДниВключенныеВГрафик = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДниВключенныеВГрафик.Вставить(Выборка.ДатаГрафика, Выборка.Смена);
	КонецЦикла;
	
	Возврат ДниВключенныеВГрафик;
	
КонецФункции

// Процедура записывает данные графика в регистр.
//
// Параметры:
//	ГрафикРаботы	- Ссылка на текущий элемент справочника.
//	НомерГода		- Номер года, за который необходимо записать график.
//	ДниВключенныеВГрафик - соответствие даты и данных к ней относящихся.
//
// Возвращаемое значение
//	Нет
//
Процедура ЗаписатьДанныеГрафикаВРегистр(Сотрудник, ДниВключенныеВГрафик, ДатаНачала, ДатаОкончания) Экспорт
	
	НаборДни = РегистрыСведений.ГрафикиРаботыСотрудников.СоздатьНаборЗаписей();
	НаборДни.Отбор.Сотрудник.Установить(Сотрудник);
	
	// Запись оптимальнее выполнять по годам.
	// Выбираем используемые годы
	// Для каждого года 
	// - считываем набор, 
	// - модифицируем его с учетом записываемых данных
	// - записываем.
	
	ДанныеПоГодам = Новый Соответствие;
	
	ДатаДня = ДатаНачала;
	Пока ДатаДня <= ДатаОкончания Цикл
		ДанныеПоГодам.Вставить(Год(ДатаДня), Истина);
		ДатаДня = ДатаДня + 86400;
	КонецЦикла;
	
	// Обрабатываем данные по годам.
	Для Каждого КлючИЗначение Из ДанныеПоГодам Цикл
		Год = КлючИЗначение.Ключ;
		
		// Считываем наборы на год
		//НаборДни.Отбор.Год.Установить(Год);
		НаборДни.Прочитать();
		
		// Заполняем содержимое набора в соответствие по датам для быстрого доступа.
		СтрокиНабораДни = Новый Соответствие;
		Для Каждого СтрокаНабора Из НаборДни Цикл
			СтрокиНабораДни.Вставить(СтрокаНабора.ДатаГрафика, СтрокаНабора);
		КонецЦикла;
		
		НачалоГода = Дата(Год, 1, 1);
		КонецГода = Дата(Год, 12, 31);
		
		НачалоОбхода = ?(ДатаНачала > НачалоГода, ДатаНачала, НачалоГода);
		КонецОбхода = ?(ДатаОкончания < КонецГода, ДатаОкончания, КонецГода);
		
		// Для периода обхода данные в наборе должны быть заменены.
		ДатаДня = НачалоОбхода;
		Пока ДатаДня <= КонецОбхода Цикл
			// Если строки на дату нет в наборе - создаем ее.
			СтрокаНабораДни = СтрокиНабораДни[ДатаДня];
			Если СтрокаНабораДни = Неопределено Тогда
				СтрокаНабораДни = НаборДни.Добавить();
				СтрокаНабораДни.Сотрудник = Сотрудник;
				СтрокаНабораДни.ДатаГрафика = ДатаДня;
				СтрокиНабораДни.Вставить(ДатаДня, СтрокаНабораДни);
			КонецЕсли;
			
			// Если день включен в график, то заполним его интервалы.
			ДанныеДня = ДниВключенныеВГрафик.Получить(ДатаДня);
			Если ДанныеДня = Неопределено Тогда
				// Удаляем строку из набора, если день - нерабочий.
				НаборДни.Удалить(СтрокаНабораДни);
				СтрокиНабораДни.Удалить(ДатаДня);
			Иначе
//				СтрокаНабораДни.ДеньВключенВГрафик = Истина;
			КонецЕсли;
			ДатаДня = ДатаДня + 86400;
		КонецЦикла;
		
		НаборДни.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
